xrun(64): 23.09-s006: (c) Copyright 1995-2024 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s006: Started on Sep 09, 2024 at 20:39:49 EDT
xrun
	-define overlap
	-rnm_package
	-nowarn COVFHT
	-nowarn COVCGN
	-nowarn COVUTA
	-nowarn ICFCLD
	-nowarn WSEM2009
	-input /home/lacp3102/APP1/UdeS_S8_APP1/gei815-ashok-mehta-labs-cadence/verif/scripts/misc_commands.tcl
	-gui
	-input /home/lacp3102/APP1/UdeS_S8_APP1/gei815-ashok-mehta-labs-cadence/verif/scripts/waves.tcl
	-ACCESS +rwc
	-seed random
	test_overlap_nonoverlap.sv
file: test_overlap_nonoverlap.sv
	module worklib.test_overlap_nonoverlap:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		test_overlap_nonoverlap
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.test_overlap_nonoverlap:sv <0x70e62e9e>
			streams:  12, words: 19443
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		          Instances  Unique
		Modules:          1       1
		Registers:       17      17
		Named events:     2       2
		Always blocks:   12      12
		Initial blocks:   6       6
		Assertions:       2       2
	Writing initial simulation snapshot: worklib.test_overlap_nonoverlap:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
SVSEED set randomly from command line: -737109530

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /mnt/opt/cmc/tools/cadence/XCELIUMMAIN23.09.006_lnx86/tools/xcelium/files/xmsimrc
xcelium> ########################################################################
xcelium> ## Author  :    Marc-Andre Tetrault
xcelium> ## Project :    Verification Primer
xcelium> ##
xcelium> ## Universite de Sherbrooke
xcelium> ########################################################################
xcelium> #
xcelium> # Purpose   :   Misc Commands sent to simulator
xcelium> ########################################################################
xcelium> 
xcelium> 
xcelium> # get the seed. Reference: "SystemVerilog Reference" from Cadence Help tool (cdnshelp)
xcelium> set RetrievedSeed [set svseed]
-737109530
xcelium> puts "The SystemVerilog seed is $RetrievedSeed"
The SystemVerilog seed is -737109530
xcelium> 
xcelium> # set severity_pack_assert_off {warning}
xcelium> # set pack_assert_off {  numeric_std }
xcelium> 
xcelium> # set assert_stop_level never
xcelium> ########################################################################
xcelium> ## Author  :    Marc-Andre Tetrault
xcelium> ## Project :    Verification Primer
xcelium> ##
xcelium> ## Universite de Sherbrooke
xcelium> ########################################################################
xcelium> 
xcelium> # save all waveforms by default. Consult the Simvision user guide
xcelium> # for details on the commands and how to change recording rules
xcelium> # if disk space is an issue.
xcelium> 
xcelium> database -open waves -into waves.shm -default
Created default SHM database waves
xcelium> 
xcelium> probe -create $::env(LAB_TEST_DUT_NAME) -all -depth all -database waves
Created probe 1
xcelium> probe -create -shm test_overlap_nonoverlap.reqGnt -waveform -assertions -assertdebug
Created probe 2
xcelium> probe -create -shm test_overlap_nonoverlap.reqGnt -waveform -assertions -transaction
Created probe 3
xcelium> probe -create -shm test_overlap_nonoverlap.pr1_for_cover -waveform -assertions -assertdebug
Created probe 4
xcelium> probe -create -shm test_overlap_nonoverlap.pr1_for_cover -waveform -assertions -transaction
Created probe 5
xcelium> probe -create -shm test_overlap_nonoverlap.pr1 -waveform -assertions -assertdebug
Created probe 6
xcelium> probe -create -shm test_overlap_nonoverlap.pr1 -waveform -assertions -transaction
Created probe 7
xcelium> probe -create -shm test_overlap_nonoverlap.creqGnt -waveform -assertions -assertdebug
Created probe 8
xcelium> probe -create -shm test_overlap_nonoverlap.creqGnt -waveform -assertions -transaction
Created probe 9
xcelium> run
        10  clk=1 cstart=0 req=0 gnt=0
        30  clk=1 cstart=1 req=0 gnt=0
  req ##2 gnt;
    |
xmsim: *E,ASRTST (./test_overlap_nonoverlap.sv,40): (time 30 NS) Assertion test_overlap_nonoverlap.reqGnt has failed (1 cycles, starting 30 NS)
30 NS + 1 (Assertion output stop: test_overlap_nonoverlap.reqGnt = failed)
xcelium> run
        30  		 test_overlap_nonoverlap.reqGnt FAIL
        50  clk=1 cstart=1 req=1 gnt=0
        70  clk=1 cstart=0 req=0 gnt=0
        90  clk=1 cstart=0 req=0 gnt=1
       110  clk=1 cstart=1 req=1 gnt=0
       130  clk=1 cstart=1 req=1 gnt=0
       150  clk=1 cstart=1 req=1 gnt=1
       170  clk=1 cstart=0 req=1 gnt=0
  req ##2 gnt;
            |
xmsim: *E,ASRTST (./test_overlap_nonoverlap.sv,40): (time 170 NS) Assertion test_overlap_nonoverlap.reqGnt has failed (3 cycles, starting 130 NS)
170 NS + 1 (Assertion output stop: test_overlap_nonoverlap.reqGnt = failed)
xcelium> run
       170  		 test_overlap_nonoverlap.reqGnt FAIL
       190  clk=1 cstart=0 req=0 gnt=0
  req ##2 gnt;
            |
xmsim: *E,ASRTST (./test_overlap_nonoverlap.sv,40): (time 190 NS) Assertion test_overlap_nonoverlap.reqGnt has failed (3 cycles, starting 150 NS)
190 NS + 1 (Assertion output stop: test_overlap_nonoverlap.reqGnt = failed)
xcelium> run
       190  		 test_overlap_nonoverlap.reqGnt FAIL
       210  clk=1 cstart=0 req=0 gnt=1
Memory Usage - Current physical: 82.1M, Current virtual: 378.7M
CPU Usage - 1.6s system + 1.0s user = 2.5s total (2.5% cpu)
Simulation complete via $finish(2) at time 220 NS + 0
./test_overlap_nonoverlap.sv:62   @(negedge clk); $finish(2);
xcelium> run
xmsim: *E,RNFNSH: Cannot continue simulation due to a previous $finish.
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	23.09-s006: Exiting on Sep 09, 2024 at 21:30:54 EDT  (total: 00:51:05)
